In [1]:
import numpy as np
import pandas as pd

In [2]:
sozluk1={"isim":["ahmet","mehmet","zeynep","ali"],
         "spor":["okçuluk","yüzme","fitness","basketbol"],
         "kalori":[100,300,250,250]}

In [3]:
sozluk1_df=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [4]:
sozluk1_df

     isim       spor  kalori
0   ahmet    okçuluk     100
1  mehmet      yüzme     300
2  zeynep    fitness     250
3     ali  basketbol     250

In [5]:
sozluk2={"isim":["osman","ajdar","buğra","ali"],
         "spor":["okçuluk","yüzme","fitness","basketbol"],
         "kalori":[105,303,257,251]}

sozluk2_df=pd.DataFrame(sozluk2,index=[4,5,6,7])

In [6]:
sozluk2_df

    isim       spor  kalori
4  osman    okçuluk     105
5  ajdar      yüzme     303
6  buğra    fitness     257
7    ali  basketbol     251

In [7]:
sozluk3={"isim":["oktay","necmi","buğra","ali"],
         "spor":["okçuluk","yüzme","fitness","basketbol"],
         "kalori":[155,323,237,291]}

sozluk3_df=pd.DataFrame(sozluk2,index=[8,9,10,11])

In [8]:
sozluk3_df

     isim       spor  kalori
8   osman    okçuluk     105
9   ajdar      yüzme     303
10  buğra    fitness     257
11    ali  basketbol     251

# CONCAT ([])

axis=0 SATIRLARI BİRLEŞTİRİR

axis=1 SÜTUNLARI BİRLEŞTİRİR

In [9]:
sozluk_concat=pd.concat([sozluk1_df,sozluk2_df,sozluk3_df],axis=0)

In [10]:
sozluk_concat

      isim       spor  kalori
0    ahmet    okçuluk     100
1   mehmet      yüzme     300
2   zeynep    fitness     250
3      ali  basketbol     250
4    osman    okçuluk     105
5    ajdar      yüzme     303
6    buğra    fitness     257
7      ali  basketbol     251
8    osman    okçuluk     105
9    ajdar      yüzme     303
10   buğra    fitness     257
11     ali  basketbol     251

In [11]:
deger=sozluk_concat.groupby(["isim"])
deger.count()

        spor  kalori
isim
ahmet      1       1
ajdar      2       2
ali        3       3
buğra      2       2
mehmet     1       1
osman      2       2
zeynep     1       1

In [12]:
sozluk_concat=pd.concat([sozluk1_df,sozluk2_df,sozluk3_df],axis=1)

In [13]:
sozluk_concat

,isim,spor,kalori,isim,spor,kalori,isim,spor,kalori
0,ahmet,okçuluk,100.0,NaN,NaN,NaN,NaN,NaN,NaN
1,mehmet,yüzme,300.0,NaN,NaN,NaN,NaN,NaN,NaN
2,zeynep,fitness,250.0,NaN,NaN,NaN,NaN,NaN,NaN
3,ali,basketbol,250.0,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,osman,okçuluk,105.0,NaN,NaN,NaN
5,NaN,NaN,NaN,ajdar,yüzme,303.0,NaN,NaN,NaN
6,NaN,NaN,NaN,buğra,fitness,257.0,NaN,NaN,NaN
7,NaN,NaN,NaN,ali,basketbol,251.0,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,osman,okçuluk,105.0
9,NaN,NaN,NaN,NaN,NaN,NaN,ajdar,yüzme,303.0
10,NaN,NaN,NaN,NaN,NaN,NaN,buğra,fitness,257.0
11,NaN,NaN,NaN,NaN,NaN,NaN,ali,basketbol,251.0

# 6.11 merge

In [14]:
merge_dict1={"isim":["ahmet","mehmet","necmi","bugra"],
           "spor":["okçuluk","yüzme","fitness","basketbol"]
           }

merge_dict1_df=pd.DataFrame(merge_dict1)

In [15]:
merge_dict1_df

     isim       spor
0   ahmet    okçuluk
1  mehmet      yüzme
2   necmi    fitness
3   bugra  basketbol

In [16]:
merge_dict2={"isim":["ahmet","mehmet","necmi","bugra"],
           "kalori":[155,323,237,291]
           }

merge_dict2_df=pd.DataFrame(merge_dict2)

In [17]:
merge_dict2_df

     isim  kalori
0   ahmet     155
1  mehmet     323
2   necmi     237
3   bugra     291

pd.merge(df1,df2,df3,on="isim")

on BURADA HANGİ ŞEYİ ORTAK ÖZELLİK OLARAK BAZ ALALIM DEMEK


YANİ HANGİ ŞEY ÜZERİNDEN BİRLEŞTİRELİM

In [18]:
merge_result=pd.merge(merge_dict1_df,merge_dict2_df,on="isim")

In [20]:
merge_result

     isim       spor  kalori
0   ahmet    okçuluk     155
1  mehmet      yüzme     323
2   necmi    fitness     237
3   bugra  basketbol     291

# 6.12

In [22]:
maassozluk={"isim":["ahmet","mehmet","ali","yusuf"],
           "departman":["yazılım","pazarlama","lojistik","yazılım"],
           "maas":[1000,750,800,2000]}

In [23]:
maas_df=pd.DataFrame(maassozluk)

In [27]:
maas_df

     isim  departman  maas
0   ahmet    yazılım  1000
1  mehmet  pazarlama   750
2     ali   lojistik   800
3   yusuf    yazılım  2000

departmanın UNİQUE değerlerini getirdi

In [28]:
maas_df["departman"].unique()

array(['yazılım', 'pazarlama', 'lojistik'], dtype=object)

departmanın UNİQUE değerlerinin sayısını getirdi

In [26]:
maas_df["departman"].nunique()

3

değer sayısını veriyor nerede ne kadar

In [29]:
maas_df["departman"].value_counts()

yazılım      2
lojistik     1
pazarlama    1
Name: departman, dtype: int64

In [34]:
def fonk(maas):
    return maas*0.66

bi metod vs. yi uygular

In [33]:
maas_df["maas"].apply(fonk)

0     660.0
1     495.0
2     528.0
3    1320.0
Name: maas, dtype: float64

In [35]:
maas_df.isnull()

    isim  departman   maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

pivot_table(values,index,aggfunc)

pivot_table multi index e benziyor 

aggfunc yapılacak işlemi söyler eğer aynı şeyden birden fazla varsa

In [36]:
yeni_data={"film türü":["komedi","aksiyon","yarış","dram"],
           "filmler":["yazılım","pazarlama","lojistik","finans"],
           "karakterler":["john cena","cristi","jason","dwayne"]}

In [37]:
yeni_data_df=pd.DataFrame(yeni_data)

In [40]:
yeni_data_df.pivot_table(values="karakterler",index=["film türü","filmler"],aggfunc=np.sum)

                    karakterler
film türü filmler
aksiyon   pazarlama      cristi
dram      finans         dwayne
komedi    yazılım     john cena
yarış     lojistik        jason